const { ImapFlow } = require('imapflow');
const { simpleParser } = require('mailparser');
const fs = require('fs');
const path = require('path');
const prisma = require('../utils/prisma');

//ฟังก์ชันสำหรับเชื่อมต่อและดึงข้อมูลอีเมล ผ่านไลบรารีที่ชื่อว่า Imapflow
async function fetchEmails() {
    const client = new ImapFlow({ // configure การเชื่อมต่อ ดึงค่ามาจากไฟล์ .env
        host: process.env.IMAP_HOST,
        port: process.env.IMAP_PORT,
        secure: true,
        auth: { // (Authentication) จาก user/pass ที่ส่งไป
            user: process.env.IMAP_USER,
            pass: process.env.IMAP_PASS,
        },
    });

    // เชื่อมต่อกับเซิร์ฟเวอร์อีเมล และเปิดกล่องจดหมาย INBOX
    await client.connect();
    await client.mailboxOpen('INBOX');
    console.log('📥 IMAP connected');

    //
    const uids = await client.search({ all: true });
    const lastUids = uids.slice(-5);

    for (const uid of lastUids) {
        const msg = await client.fetchOne(uid, { source: true });
        const parsed = await simpleParser(msg.source); // simpleParser จะทำหน้าที่ ถอดรหัส ให้กลายเป็น Object ที่เราเรียกใช้งานง่ายๆ เช่น parsed.subject หรือ parsed.text

        const email = await prisma.email.create({ // prisma.email.create: สั่งให้ ORM (Prisma) นำข้อมูลที่เราแกะได้ไป Insert ลงในตาราง email ใน Database
            data: {
                imapUid: uid,
                fromEmail: parsed.from?.text || '',
                subject: parsed.subject || '',
                bodyText: parsed.text || '',
                receivedAt: parsed.date || new Date(),
            }, // การใช้ || '' หรือ || new Date(): เป็นการป้องกัน Error (Fallback) ในกรณีที่อีเมลฉบับนั้นไม่มีหัวข้อ หรือไม่มีวันที่ส่งมา
        });

        // มี attachments?
        if (parsed.attachments?.length) {
            //การกำหนดเส้นทางจัดเก็บ (path.join)
            const dir = path.join(__dirname, '../../storage', email.id);
            //recursive: true: ถ้าโฟลเดอร์ตามเส้นทางที่ระบุ (เช่น storage/) ยังไม่มีอยู่ ให้สร้างขึ้นมาให้ครบทุกลำดับชั้นโดยอัตโนมัติ รวมถึงจะไม่แจ้ง Error หากโฟลเดอร์นั้นมีอยู่แล้ว
            fs.mkdirSync(dir, { recursive: true });

            // บันทึกไฟล์จริงลงใน Disk และ สร้างประวัติไฟล์แนบในฐานข้อมูล
            // เข้าไปดูใน parsed.attachments (ซึ่งได้มาจาก simpleParser) ว่าอีเมลฉบับนี้มีไฟล์แนบกี่ไฟล์ และหยิบมาจัดการทีละไฟล์จนครบ
            for (const file of parsed.attachments) {
                // รวมร่างระหว่าง "ที่อยู่โฟลเดอร์" (dir) และ "ชื่อไฟล์" (file.filename) เพื่อให้ได้เส้นทางเต็มของไฟล์ที่จะบันทึกลง Disk
                const filePath = path.join(dir, file.filename);
                //fs.writeFileSync: นำข้อมูลดิบของไฟล์ (file.content) เขียนลงไปใน Disk ทันทีตามเส้นทางที่กำหนดไว้
                fs.writeFileSync(filePath, file.content);

                // เป็นการสร้าง Foreign Key (emailId) เพื่อเชื่อมไฟล์แนบเข้ากับตัวอีเมลหลัก ทำให้เวลาอยากดูว่า "อีเมลฉบับนี้มีไฟล์อะไรบ้าง" สามารถ Query หาจาก emailId ได้ทันที
                await prisma.attachment.create({
                    data: {
                        emailId: email.id, // เชื่อมโยงว่าไฟล์นี้เป็นของอีเมลฉบับไหน
                        fileName: file.filename,
                        fileType: file.contentType, // ประเภทไฟล์ เช่น image/jpeg, application/pdf
                        filePath, // เก็บที่อยู่ไฟล์ไว้สำหรับเรียกใช้งานภายหลัง
                    },
                });
            }
        }
        console.log(`✉️ Saved email: ${parsed.subject}`);
    }
    await client.logout(); //บอกให้ Email Server ทราบว่าเราทำงานเสร็จแล้วนะ ให้ปิด Session นี้ได้เลย
    console.log('✅ ดึงข้อมูล IMAP เสร็จสิ้น');
}

module.exports = { fetchEmails }; // ส่งออกฟังก์ชัน fetchEmails เพื่อให้ไฟล์อื่นๆ สามารถเรียกใช้งานได้